<template>
	<view class="container">
		<h1>团蜂家居隐私政策</h1>
		<p>
			我们非常注重保护用户（“您”）的个人信息及隐私，并希望通过本概要向您
			简洁介绍我们如何收集、使用和保护您的个人信息。
		</p>
		<p class="blod">一、我们如何收集和使用您的个人信息</p>
		<p class="blod">注册信息</p>
		<p>
			团蜂家居使用团蜂账号体系，需要您使用团蜂家居注册或登录。在您注册成为
			团蜂家居用户时，您需要至少提供手机号码以创建团蜂账号，并完善相关的网络身
			份识别信息（如头像、昵称及登录密码等）；如果您仅需使用浏览功能，您无
			需注册成为我们的用户以及提供上述信息。
		</p>
		<p class="blod">地理位置</p>

		<text class="blod">使用目的</text>：经您授权，我们会收集您的地理位置信息，以便为您推荐周边的生
		活服务，以及估算商家和您之间的距离以便于您进行消费决策等。

		<p>
			<text class="blod">信息说明</text>：位置信息的来源包括 IP 地址、GPS
			以及能够提供相关信息的 WLAN （如 Wi-Fi） 接入点、蓝牙和基站等传感器信息。
			当您拒绝位置授权后仍然可以手动选择或输入位置信息，不会影响您使用浏
			览、下单等基本服务。在为你提供同城频道内容或者与设备所在位置相关的内容或服务时，经过你的授权，我们会使用与本服务相关的地理位置信息（如精确定位信息、WLAN接入点、蓝牙和基站、传感器信息），以保障内容或服务的质量，并向你推荐可能感兴趣的内容或服务。其中精确定位信息是个人敏感信息，若你拒绝授权位置权限会影响定位的准确性，但不会影响其他功能与服务的正常使用，我们也仅会基于网络信息（如IP）对应的城市及/或区县向你展示可能相关的内容或服务。
		</p>

		<p class="blod">相机</p>

		<text class="blod"> 使用目的 </text>：经您授权，我们会收集您的相机信息，以便为您提供扫码、拍照等 功能。
		<p>
			<text class="blod">信息说明</text>：我们仅在您使用对应功能时收集相应信息，例如您使用扫码拍照等
			功能时。不同的系统显示的名称可能有所差异，如相机、摄像头等。
			您可以自行选择开启或关闭相机的授权，一旦关闭您将可能无法使用扫码、拍
			照等功能，但不会影响您使用浏览、下单等基本服务。
		</p>

		<p class="blod">相册</p>

		<text class="blod"> 使用目的 </text>：经您授权，我们会收集您的相册信息，以便为您上传和保存照片、 视频等功能。

		<p>
			<text class="blod">信息说明</text>：我们仅在您使用对应功能时收集相应信息，例如您使用上传和保存
			照片、视频等功能时。不同的系统显示的名称可能有所差异，如相册、存储权
			限等。 您可以自行选择开启或关闭相册的授权，一旦关闭您将可能无法通过上传图
			片、视频等方式来发布评价等功能，但不会影响您使用浏览、下单等基本服务。
		</p>

		<p class="blod">麦克风</p>
		<text class="blod">使用目的</text>：经您授权，我们会收集您的录音信息，以便为您提供语音搜索、智
		能点餐等语音交互功能。
		<p>
			<text class="blod">信息说明</text>：我们仅在您使用对应功能时收集相应信息，通过申请麦克风权限以
			便获得声音，以提供对应的识别后后续的交互功能。不同的系统显示的名称可
			能有所差异，如麦克风、录音权限等。
			您可以自行选择开启或关闭麦克风授权，一旦关闭您将可能无法使用诸如“按
			住说话”、语音交互等相关功能，但不会影响您使用浏览、下单等基本服务。
			麦克风权限需要您的额外授权，您也可以在系统权限中自主控制，我们绝不会
			私自开启您的麦克风权限，更不会非法利用非法手段进行相关信息的收集和使
			用，请您放心。
		</p>

		<p class="blod">设备信息</p>
		<text class="blod"> 使用目的 </text>：在您访问或使用我们服务的过程中，我们会收集您的设备信息，以
		便获取屏幕分辨率等信息进行界面展示、避免其他设备的异常登录、留存必要
		的日志信息，从而保障您的账号安全、交易安全和系统运行安全。此外，如您
		未登录账号，我们使用您的设备信息以便为您推送对应的信息展示。
		<p>
			<text class="blod">信息说明</text>：我们收集的设备状态包括您的设备型号、硬件序列号、设备 MAC 地
			址、唯一设备识别码（如 IMEI/androidID/IDFA/OPENUDID/GUID/OAID、SIM 卡
			IMSI、ICCID 信息等设备标识符）、移动应用列表、电信运营商等。未经您的
			授权，我们不会提前获取以上信息。目前多数手机终端厂商支持对设备标识符
			的更改，以保障您对个人信息的自主控制，具体撤回或更改的方式可参见您所
			使用的终端设备说明。
			产品安全保障功能：为了保障您的账号安全和系统安全，我们需要获取您的设备MAC地址、IMSI、Android ID、IP地址、硬件型号、操作系统版本号、唯一设备标识符（IMEI等）、网络设备硬件地址（MAC）、软件版本号、网络接入方式、类型、状态、网络质量数据、操作日志、硬件序列号、服务日志信息，收集运行中的进程，已安装应用列表等行为。
		</p>

		<p class="blod">您使用过程中主动提供的信息</p>
		<text class="blod"> 使用目的 </text>：在您使用我们提供的产品/服务过程中，我们根据您使用的特定场景
		可能会收集您提供的个人信息，以实现您所需要使用的功能。
		<p>
			<text class="blod"> 信息说明 </text>：我们会根据具体的场景请求您提供对应的信息并会严格依法保护您
			的个人信息，例如下单需要您提供联系人信息、联系方式、收货地址信息，撰
			写带图评价时需要提供昵称、头像、相关评价图片/视频等发布内容。此外，如
			果您愿意额外补充您的其他个人资料，将有助于我们为您提供更加个性化的服
			务，但如果您不提供该等信息，不会影响您使用我们产品/服务的基本功能。
			除法律另有规定外，我们仅会在实现目的所必需的最短时间内留存您的相关个
			人信息。如您希望详细了解我们所收集的具体各项个人信息及对应的场景，请
			查阅概要后的隐私政策正文。
		</p>

		<p class="blod">二、我们如何共享您的信息</p>
		请您知悉，我们为您所提供的产品/服务大多是无法单独完成的，因此我们可
		能会与我们的关联公司以及其他合作商等第三方共享或委托其处理您的部分个
		人信息。目前，除再次获得您明确同意或授权外，此类共享或委托处理涉及的
		主要情形包括：根据行政、司法等有权机关的要求提供必要信息；为提供账号
		一致性服务与关联公司共享必要信息；为提供如配送、第三方支付等服务与有
		关合作商、骑手、第三方商家、支付机构等共享有关的必要信息等。
		<p class="ge">
			我们会与其签署严格的信息保护和保密协定，要求他们遵守协议并采取相关的
			安全措施来保护您的个人信息。
		</p>

		<p class="blod">三、您如何管理您的信息</p>
		<p class="ge">
			您有权管理您的个人信息，包括查询、更正和删除您的账号信息、地址信息、
			搜索记录、评论信息、设备系统权限管理情况，改变您的授权同意的范围或撤
			回授权，以及注销您的账号。您可以通过我们的 App 中提供的相应功能设置或
			隐私管理中进行上述操作。
		</p>
		如果您无法通过上述方式进行管理，您可以通过我们的公众号（团蜂）联系
		我们，我们将在 15 天内回复您的要求。

		<p class="blod">四、开发者信息</p>

		<div class="ge">
			<p>公司名称：广东团蜂科技有限公司</p>
			<p>
				公司地址：广东省佛山市顺德区龙江社区325国道龙江段第102号之二合创盈科家具材料交易中心（商务中央区1）5321-5331、5333-5386
			</p>

			<p>联系电话：13823455400139.com</p>

			<p>
				我们非常注重用户隐私和数据保护，为了保障用户的权益，我们严格遵守相关法律法规和行业标准，并建立了完善的隐私保护体系。如果您在使用我们的应用程序时，有任何问题或疑虑，请随时联系我们。我们会尽一切努力保护您的个人信息安全，绝不泄露您的任何隐私信息。
			</p>
		</div>
	</view>
</template>

<script>
	export default {}
</script>

<style lang="less" scoped>
	h1,
	view,
	text {
		line-height: 1.5;
	}

	.container {
		padding: 20upx;
		box-sizing: border-box;

		h1 {
			font-weight: 500;
			text-align: center;
			font-size: 40upx;
		}

		p.blod {
			font-weight: bold;
			margin: 20px 0;
			text-decoration: underline;
		}

		p.ge {
			margin: 10px 0;
		}

		text.blod {
			font-weight: bold;
		}

		div.ge {
			p {
				margin: 20upx 0;
			}
		}
	}
</style>