export const items = [
	{
		id: 1,
		name: '收费标准',
	},
	{
		id: 2,
		name: '服务内容',
	},
	{
		id: 3,
		name: '用户评价',
	},

]
export const subs = [
	{
		id: 1,
		title: '维修项目',
		price: '￥98~128/台',
		text: '调试设备/紧固线束、更换遥控器、更换排水管、线路修复、外机清洗',
	},
	{
		id: 2,
		title: '普通维修',
		price: '￥108~798/台',
		text: '价值冷制、清理氟系统堵塞、维修遥控接收板、更换接水盘（外机）、维修风机、维修排水系统、更换空开、漏保、维修空开、漏保、更换温度探头、换相序板、维修相序版、更换电辅热、维修电辅热、更换光电开关、维修光电开关、清理过滤网等等',
	}
]
export const projects = [
	{
		id:1,
		name:'维修项目',
	},
	{
		id: 2,
		name: '特殊项目',
	},
	{
		id: 3,
		name: '附加项目',
	}
]