<template>
  <tui-popup :duration="500" :modeClass="['fade']" style="position: fixed; bottom: 0; top: 0; left: 0; right: 0; display:flex;justify-content: center;
		align-items:center;background-color: rgba(0, 0, 0, 0.7);" :show="transShow" @click="transShow = false">
    <view class="tui-text">
      <view class="title">
        用户注销协议
      </view>
      尊敬的用户，在您正式开始下一步有关本产品或服务的账号注销流程前，我们先为您做出如下特别说明：注销本产品或服务的账号后，除法律法规或本协议另有规定外，您在该账号下的个人信息将进行删除或匿名化处理，且此前已关联该账号的相关产品与服务将不再关联。该账号一旦注销完成，将无法恢复，请您谨慎操作。

      若您经过慎重考虑后仍决定注销本产品或服务账号的，请您务必先行仔细阅读和充分理解本《账号注销协议》（“本协议”），并同意本协议全部内容，尤其是本协议免责、限制条款（如第一条、第3.3条）及争议解决方式和管辖条款（第4.2条、4.3条和4.4条），前述条款可能以黑体加粗、颜色标记或其他合理方式提示您注意，本协议由您与本产品或服务的提供方（以下称“团蜂科技”或“我们”）共同缔结，本协议具有合同效力。您按照我们的注销操作流程开始注销流程的，或者您勾选本协议并开始下一步操作的，均视为您已经同意和遵守本协议全部内容。

      为确保注销的顺利完成，请您在约定的账号注销申请处理期间内不要使用该账号登录本产品或服务，否则视为您撤销注销该账号。

      如您在注销后需要再次使用我们的服务的，欢迎您使用微信或团蜂认可的其他账号等方式重新注册登录（可支持登录的账号以产品具体提供的为准）。

      <view>
        一、您知悉并同意：在您的账号注销后，将（可能）产生包括但不限于如下结果，并需要您自行承担：
      </view>

      <view>
        1.1您将无法登录、使用该账号，您的好友可能无法与您在本产品或服务内进行互动；
      </view>

      <view>
        1.2除法律法规或本协议另有规定外，您该产品账号下的个人信息将会被删除或匿名化处理。您无法再找回您的个人信息，也无权要求我们找回，前述个人信息包括但不限于：头像、昵称、战绩、充值和消费记录、聊天记录等内容（如有）；
      </view>

      <view>
        如您的账号曾因违反国家相关法律法规及（或）本产品或服务的相关协议、规则相关规定被我们采取封号及（或）其他处理措施的，为了维护您及其他相关权利人的合法权益所必须，在您账号注销后我们可能会对与该账号违规行为有关的数据保留3年。在保留期限内，我们除将该数据用于维护您及其他相关权利人的合法权益外，不会用于其他目的
        ；
      </view>

      <view>
        1.3您知悉，账号注销的，该产品账号下的相关收益也将会被删除，据此，也特别提示您，在您注销本产品账号前请您妥善处理您账号下的相关收益或权益。一旦您注销本账号，如该账号下还存在相关收益或权益的（包括在本产品使用期间已产生的及未来可能产生的收益），视为您自愿放弃该等收益或权益，我们有权对该账号下的全部收益或权益做清除处理，因此产生的后果由您自行承担，您同意不会要求我们恢复或赔偿该等收益或权益。前述收益或权益包括但不限于：会员权益、等级；尚未使用的优惠券、兑换券、虚拟道具及其他虚拟物品（如卡券、金币、钻石、道具及其他等）；已经购买的未到期的服务；已产生但未消耗完毕的其他收益或未来预期的收益或权益等
      </view>

      <view>
        1.4本产品或服务账号一旦注销，您与我们签署的有关本产品或服务的服务协议终止（但已约定继续生效的除外）。但前述服务协议的终止并不影响该账号注销前您使用本产品或服务应当承担的相关责任，您仍需要对该账号注销前使用本产品或服务的行为承担相应责任，包括但不限于可能产生的违约责任、损害赔偿责任及履约义务等；
      </view>

      <view>
        1.5其他因账号注销（可能）产生的结果
      </view>

      <view>
        二、在您向我们申请/继续申请注销账号之前，为保障您的账号安全和相关权益，您需先行检查，并确保和承诺您申请注销的账号已经同时满足以下条件，这些条件包括但不限于：
      </view>
      <view>
        2.1注销条件账号处于安全状态：账号正常使用中，未处于违规处理期间，且没有被盗、被封等风险；
      </view>
      <view>
        2.2该账号中的相关收益或权益已结清或得到妥善处理：包括但不限于点券、钻石、金币、道具、体验卡、会员权益及其他收益等。请您妥善处理您的收益或权益，若注销时未处理，视为您自愿放弃该等收益或权益;
      </view>
      <view>
        2.3该账号无处于未完成状态订单：包括但不限于基于该账号产生的有关虚拟道具、周边商品等的订单；
      </view>
      <view>
        2.4该账号无任何纠纷：包括投诉举报、被投诉举报、国家机关调查、仲裁、诉讼等纠纷；
      </view>
      <view>
        2.5本产品或服务官方公布的其他条件；
      </view>
      <view>
        上述问题您可首先尝试自行处理，如您无法处理的或在处理过程中有任何疑惑的，可联系团蜂客服协助处理。
      </view>


      <view>
        三、如何注销账号？
      </view>

      <view>
        3.1您需按照我们的官方渠道提供的注销流程和操作指引，在相关功能设置页面进行注销操作；
      </view>

      <view>
        3.2您已经同意本注销协议的全部内容；同时，您已经检查与确认满足了本协议第二条的要求；
      </view>

      <view>
        3.3在您完成上述第3.2条后，为进一步保障您的相关合法权益，我们有权视情况验证您是否满足本协议第二条规定的部分或全部注销条件。如我们验证的，我们有权根据您的账号安全状态以及您对相关产品与服务的使用情况等综合判断您的账号是否符合该注销条件。为保障您的账号安全和财产权益，我们有权进行注销申请的身份验证以判断您是该账号的有权使用人。如我们在综合判断后发现该账号不符合注销条件的，或者身份验证失败的，您的注销可能会失败，您可以按照我们的指引进行后续操作或联团蜂客服协助处理。即使我们判断您符合注销条件的，也是基于您的承诺（即您自身确保账号符合上述注销条件的承诺）进行的形式审查，仍由您自身对账号符合上述注销条件承担保证责任，我们对此不承担相应的法律责任；
      </view>

      <view>
        3.4我们将在15个工作日内完成您的注销申请核查和处理。具体注销流程和规则以本产品或服务官方说明的账号注销规则为准。
      </view>

      但请注意，若您在约定的账号注销申请处理期间使用该账号登录和使用本产品或服务，则视为您撤销该账号注销申请。同时您理解并同意，在对该账号下的个人信息删除或匿名化之前，为最大程度保障您和其他用户合法权益，我们需要一定时间对该账号下的个人信息作相应梳理和处理，因此，我们删除或匿名化处理该账号下个人信息可能会存在一定的延迟；

      <view>
        3.5您理解并同意，在您申请注销账号期间，如我们需要对相关交易、投诉或其他与您的账号相关的事项进行核实的，或者我们有其他合理的理由的，我们有权冻结您的账号注销申请并暂停为您提供注销服务。
      </view>

      <view>
        四、其他
      </view>


      <view>
        4.1您知悉并同意：即使您该产品（或服务）的账号被注销，也并不减轻或免除您应根据相关法律法规、相关协议、规则等（可能）需要承担的相关责任。
      </view>



      <view>
        4.2本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。
      </view>


      <view>
        4.3您和团蜂之间因本协议发生的（和/或与本协议有关的）任何纠纷或争议，首先友好协商解决；协商不成的，您同意将纠纷或争议提交至本协议签订地有管辖权的人民法院管辖。
      </view>


      <view>
        4.4如在账号注销过程中有任何问题您无法处理的或在处理过程中有任何疑惑的，可联系团蜂客服协助处理。
      </view>

    </view>
  </tui-popup>
</template>

<script>
export default {
  data() {
    return {
      transShow: false
    }
  },
  methods: {
    show() {
      this.transShow = true
    }
  },
}
</script>

<style lang="less" scoped>
.tui-text {
  width: 90%;
  height: 800upx;
  background-color: #fff;
  overflow: scroll;
  padding: 30upx;
  box-sizing: border-box;
  border-radius: 20upx;
  line-height: 1.5;
  font-size: 28upx;

  .title {
    text-align: center;
    font-size: 32upx;
    color: #000;
    font-weight: bold;

  }
}
</style>