<template>
  <view class="infomation-detail-container">
    <Header title=" "></Header>
    <view class="main">
      <view class="article-title"
        >【行业解析】国内材料市场价格大幅上涨 家具行业持续扩大需求</view
      >
      <view class="bage">
        <view class="time">2022年9月21日 星期三</view>
        <view class="author">家具材料网</view>
      </view>

      <Carousel height="78"></Carousel>

      <view class="article-main">
        <p>
          由乡镇企业起家，经过30多年的历练，三祥新材股份有限公司（以下简称三祥新材）逐步走到锆产业前列。该公司看不见摸不着的企业文化实际上是留住关键人才、实现技术突破的法宝，也是维护产业链上下游关系的利器。在携手宁德时代新能源科技股份有限公司（以下简称宁德时代）布局的镁铝合金业务上，整合产业资源、汇集多方优势体现得淋漓尽致。
          近日，笔者走进三祥新材，与其董事长夏鹏面对面交流，寻迹该公司拓展锆产业并延伸至镁铝合金的脉络，解码其成长秘诀。
          在山里孕育创新
        </p>
        <p>
          福建省宁德市已经凭借电池产业名扬资本市场，但知道宁德市寿宁县的人可能并不多。寿宁县位于福建省和浙江省交界处，坐落于遍布茶园的群山之间，就连暑热都难以逼近。
          20世纪90年代，从福州到寿宁县需要10小时车程。随着交通基础设施日趋完善，现在只需2个多小时车程。寿宁县真正展现出“两省门户，五界通衢”的区位优势，在经济发展中，受到毗邻温州、宁德的辐射作用。
          就是在这里，三祥新材从一家小小的乡镇企业，成长为国家专精特新“小巨人”企业和制造业“单项冠军”。每年，来自澳大利亚和非洲的数万吨锆砂运到这里，生产出一系列锆产品，销售到海内外的众多应用领域。
          在寿宁老县城沿街有一栋不起眼的七层小楼，夏鹏就在这里办公，办公室后面就是职工宿舍，如今他还和员工们一起住在这里。对于公司30多年来的成长故事，夏鹏如数家珍，谈及公司发展的秘诀，他的回答很简单：“用创新打开自己的生存之道。”
          1988年，三祥新材以硅铁合金起家，凭借的是当地的矿山和水电资源。当时，国内硅铁供过于求，甚至出现成本售价倒挂。夏鹏回忆道：“那是经营最困难的时候，但公司坚持紧抓产品质量，后来产品被日本一家研究所看中，对方从外贸渠道跟踪产品到寿宁县，考察后决定投资。”由此，三祥新材开始了多元合金生产，并填补了该项产品的国内空白。
          2000年，该公司上马电熔锆、单晶电熔铝和包芯线三大项目，正式步入新材料产业。寿宁县素有福建省“水电十强县”之称，借助这一优势，三祥新材全资收购当地一座装机1.38万千瓦的水电站，现在该电站能够满足生产所需60%的能源，显著降低用电成本。
          “最初的锆产业技术都是从发达国家引进的，锆含量有95%和92%两个等级，因为生产过程温度很高，为了维持设备稳定，必须在生产一部分95%含量产品后，再调低至92%含量。在此基础上，我们通过引进吸收再创新，团队攻克下100多个难题，最终生产出锆含量99.8%的全球纯度最高的电熔氧化锆产品，并获得了该项技术专利。因此才能在更多领域拓展应用。”夏鹏说。
          创新背后需要人才的推动，在这样一个山区小城，三祥新材如何引来“凤凰”、留住“凤凰”？夏鹏在业内交流时，经常被问到这个问题。他认为，仅凭“待遇留人”是不够的，还需要“感情留人”，而最重要的王牌则是“事业留人”。
          他举了一位老员工的例子，创业伊始，公司一位总工程师准备跳槽，对方开出的条件是12万元年薪，还送一套福州的房子，而当时该员工在三祥新材的月薪只有3000元。夏鹏并没有直接劝阻，而是与他促膝长谈公司未来的发展潜力，最终把人留到了现在。该员工2011年荣获“全国五一劳动奖章”，还当选为全国第十九次党代会代表。“他今年60岁了，不想退休，还想在公司继续发挥余热。”夏鹏说。
          “我们公司倡导的文化是同心为本，用自己的平台发展把人心凝聚在一起，别人高薪也挖不走，这样才有了我们今天的人才。”夏鹏称。
          现在，三祥新材仍在不断扩充人才队伍，在福州和上海设立了研发中心分支机构，部分博士等高端人才可以在两地工作，既能接触实地生产过程，也能在产业链密集、前沿技术集中的地方吸收养分。此外，三祥新材还与天津大学、东北大学、上海应用技术大学等高校以及中国科学院等高校建立合作，与实验室共享研发成果。
          拓展锆产业布局
        </p>
        <p>
          技术创新领航，三祥新材拓展新产品更加游刃有余。2016年是该公司发展的关键节点，三祥新材登陆A股，在资本市场的助推下，围绕锆产业展开了更丰富的产品布局。
          锆产品主要沿着两条纵向的产业链展开：一条是电熔氧化锆，年产能为2.6万吨。通过收购辽宁华锆，产品线延伸至下游海绵锆领域，规划年产能5000吨，今年计划生产2000吨。另一条是氧氯化锆，子公司辽宁华祥计划建设年产能10万吨项目，一期产能2万吨将在今年投产，这条线的下游产品纳米氧化锆也已顺利投产。
          目前，该公司电熔锆的全球市占率约在35%左右，氧氯化锆随着产能的逐步提升市场占有率将达到40%，海绵锆的市场占有率已达到60%以上。
          在扎根锆产业数十年间，市场经济大潮并非没有涌现过新鲜的诱惑。夏鹏坦言：“前些年有人提过建议，去做房地产、矿产开采、天然气等行业，但我都没有接受，要办高新企业，坚持做好主业。”
          持续深耕在机遇到来时就会收获回报。近两年，中国光伏产业强劲增长，带动玻璃生产商对耐火材料的需求，对电熔氧化锆市场形成利好；在汽车零配件领域，欧美等国家和地区环保要求替代含铜的刹车片，锆刹车片因此获得增长机遇，该公司刹车片产品从过去每年50吨~100吨持续增长，今年可能超过2000吨。
          在上游资源端，海外锆英砂的产能因疫情影响有所下滑。在保证供应链方面，三祥新材有自己的硬实力。目前，公司每年锆英砂用量在3.5万~4.5万吨，将来扩产落地后，每年需求可能达到10万吨，在全球每年用量中占比超过10%。庞大的采购量是话语权的基础，目前，该公司暂时没有做较高风险的矿山投资，但通过与供应商签订长协形成了稳定的供应关系。
          此外，凭借诚信平等的公司文化，三祥新材也形成了一套软实力。“公司有一个不成文的规定，不能让供应商请客，对待供应商和客户一视同仁。这是早年从日本学来的理念，这样才能形成上下游协同发展的健康关系。与供应商签好的订单，即便市场价格跌了我们也不会随意毁约。去年原材料紧张的时候，我们还是优先供应对象，一直保持着稳定的供应。”夏鹏称。
          在供需两侧因素的推动下，锆系列产品价格在最近两年显著上升。2022年上半年，电熔氧化锆价格在4万~4.5万元左右，较去年同期增长约50%，海绵锆价格在20万/吨以上，去年同期仅为13万/吨左右。
          量价齐升拉动三祥新材的业绩表现。2021年，该公司实现营业收入7.89亿元，同比增长7.65%；归母净利润1亿元，同比增长54.98%。该公司预计，今年上半年归母净利润约为8000万元至9000万元，同比增长70.11%~91.37%。
          发力镁铝合金增长极
        </p>
        <p>
          近年来，三祥新材将多元合金的经验拓展到镁铝合金、先进陶瓷两大产业，随着新产品逐步落地，有望成为该公司的第二条增长曲线。
          与宁德时代等公司合作的镁铝合金业务尤为受到市场关注。新能源汽车追求降低成本、提升续航、减少能耗，因此，汽车轻量化逐渐成为行业趋势，而镁铝合金恰好是轻量化的理想材料。2020年底，三祥新材、宁德时代、广东文达及万顺集团四家公司联合成立了宁德文达镁铝科技有限公司（以下简称宁德文达），切入轻量化领域。三祥新材持股35%。
          谈及几家公司联手的契机，夏鹏表示，这是基于各方优势的强强联合，“宁德时代是全球领先的动力电池生产商，具有电池轻量化的需求；万顺集团在汽车零部件方面积累的长期经验；广东文达的镁铝合金技术团队的水平在全国领先。三祥新材自1991年以来就开始和镁材料打交道，能够提供成熟的生产技术。”
          目前，宁德文达主要生产电池端板产品，在一组排列好的电芯两侧起到固定作用。笔者在生产车间现场看到，全自动智能生产线8台压铸机已经投入生产，用于打磨合金表面的CNC数控设备也在安装调试中。车间负责人告诉笔者，现在这条产线每天可以生产2万~3万片端板，爬产完成后产量会更大。目前，这款产品已经接到宁德时代的订单并开始批量供货。
          宁德时代电池技术正在向更高的集成度和标准化发展，去年还推出用于换电车型的“巧克力电池包”。车间负责人称，配套“巧克力电池包”的底部托盘结构件正在开发中。此外，车间还计划生产用于建筑模板及电动船舶的结构件。宁德文达一期总投资8.5亿元，规划产能5万吨，预计产值15亿元。
          “宁德时代零部件中选用压铸工艺的占比在不断提升。我们希望未来成为宁德时代压铸方面的一级供应商，提供比较大的供货比例。这也是宁德时代对我们的要求，现在急切希望把产能提升上去。”夏鹏表示。
        </p>
        <p>
          此外，三祥新材在2021年通过定增募资2.2亿元，募投项目包括年产1500吨特种陶瓷项目和先进陶瓷材料研发实验室。该项目将使三祥新材从锆产业链的上游原材料领域步入下游的锆基础的材料应用领域。
          夏鹏表示，上市后的第一个5年，三祥新材围绕锆产业横向及纵向延伸拓展，逐步实现锆材料的全品类布局；今年是上市后第二个5年的开篇，所有项目逐渐落地投产，接下来将步入收获期，三祥新材将迎来“丰收”的5年。
        </p>
      </view>

      <view class="other-acticle">
        <view class="tag">相关阅读</view>

        <IndustryInformation></IndustryInformation>
        <IndustryInformation></IndustryInformation>
        <IndustryInformation></IndustryInformation>
        <IndustryInformation></IndustryInformation>
        <IndustryInformation></IndustryInformation>
        <IndustryInformation></IndustryInformation>
      </view>
    </view>
  </view>
</template>

<script>
import Header from "../../components/header";
import Carousel from "../../components/carousel";
import IndustryInformation from "../../pages/stuff/components/industry-information-pane.vue";

export default {
  components: {
    Header,
    Carousel,
    IndustryInformation,
  },
};
</script>

<style lang="less" scoped>
@import "../../style/var.less";
@import "../../style/mixin.less";

.main {
  padding: 20upx 30upx;
}

.article-title {
  font-size: 36upx;
  font-weight: bold;
  line-height: 1.5;
  color: @c3d;
}

.bage {
  display: flex;
  font-size: 20upx;
  color: @c9;
  margin: 28upx 8upx;

  .time {
    margin-right: 46upx;
  }
}

.p-container {
  &:not(:last-child) {
    border-bottom: 1upx solid #ccc;
  }
}

p {
  text-indent: 2em;
  line-height: 1.5;
  margin: 10px 0;
  font-size: 14px;
  color: @c3d;
}

.other-acticle {
  margin-top: 20px;
  .tag {
    text-align: center;
    color: @cw;
    font-size: @f12;
    width: 140upx;
    height: 46upx;
    line-height: 46upx;
    background-color: #07b9b9;
  }
}
</style>